/********************************** (C) COPYRIGHT *******************************
 * File Name          : hardware.h
 * Author             : vantr
 * Version            : V1.0.0
 * Date               : 2026/06/30
 * Description        : Оборудование флеш-памяти
 *********************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_FLHWH__
// -----------------------------------------------------------------------------
#define __SSS_FLHWH__
// -----------------------------------------------------------------------------
#include <stdint.h>
#include <string.h>
// -----------------------------------------------------------------------------
// Идентификаторы поддерживаемого оборудования
#define HW_FLASH_W25Q32_ID      0x00EF4016
#define HW_FLASH_W25Q64_ID      0x00EF4017
#define HW_FLASH_W25Q128_ID     0x00EF4018
// -----------------------------------------------------------------------------
// Описание одиночного чипа флеш-памяти
typedef struct {
    uint32_t chip_id;           // Идентификатор чипа
    uint32_t chip_size;         // Всего страниц по 256 байт в чипе
    uint32_t totalx_pages;      // Всего страниц под протокол
    uint32_t nonx_area_begin;   // Начало непрерывной области чипа
    uint16_t total_4K_sectors;  // Количество 4кб секторов на чип
    uint8_t write_enabled;      // Флаг разрешения записи
} flash_hardware_t;
// -----------------------------------------------------------------------------
// Доступные конфигурации
typedef enum {
    HW_DEV_W25Q32 = 0,
    HW_DEV_W25Q64 = 1,
    HW_DEV_W25Q128 = 2,
    HW_DEV_COUNT = 3
} flash_devices_t;
// -----------------------------------------------------------------------------
// Таблица параметров поддерживаемого оборудования
__attribute__((aligned(4))) static const flash_hardware_t FLASH_HW_TABLE[HW_DEV_COUNT] = {
    [HW_DEV_W25Q32] = {
        .chip_id = HW_FLASH_W25Q32_ID,
        .chip_size = 16384,
        .totalx_pages = 8192,
        .nonx_area_begin = 8192,
        .total_4K_sectors = 1024,
        .write_enabled = 1
    },
    
    [HW_DEV_W25Q64] = {
        .chip_id = HW_FLASH_W25Q64_ID,
        .chip_size = 32768,
        .totalx_pages = 10912,
        .nonx_area_begin = 10912,
        .total_4K_sectors = 2048,
        .write_enabled = 1
    },
    
    [HW_DEV_W25Q128] = {
        .chip_id = HW_FLASH_W25Q128_ID,
        .chip_size = 65536,
        .totalx_pages = 32768,
        .nonx_area_begin = 32768,
        .total_4K_sectors = 4096,
        .write_enabled = 1
    }
};
// -----------------------------------------------------------------------------
// Переменная для хранения ссылки на текущую конфигурацию
extern const flash_hardware_t *flash_hw;
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------
