/********************************** (C) COPYRIGHT *******************************
 * File Name          : i2c.h
 * Author             : vantr
 * Version            : V4.4.0
 * Date               : 2026/07/28
 * Description        : Драйвер аппаратного I2C контроллеров CH32X033
 * LIBRARY            : MEGAPACK
 *********************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 * ------------------------------------------------------------------------------
 * Не забывайте правильно настраивать источник тактирования MCU!
 *******************************************************************************/
// ----------------------------------------------------------------------------
// ВНИМАНИЕ! Пины аппаратного I2C толерантны к 5V VDD!
// ВНИМАНИЕ! У каждого вида корпуса свои выводы SDA/SCL!
// Проверяйте каждый раз по даташиту перед использованием!
// ----------------------------------------------------------------------------
#ifndef __XC_I2CMP_H__
#define __XC_I2CMP_H__
// ----------------------------------------------------------------------------
#include "app_config.h"
#include "SSS_Common_Lib_V1/sss_classes.h"
// ----------------------------------------------------------------------------
// Для мастера I2C не имеет значения. Задавайте любой.
// ----------------------------------------------------------------------------
#define I2C_WRITE 0
#define I2C_READ 1
// ----------------------------------------------------------------------------
typedef enum {
    I2C_ERROR_SUCCESS = 0,
    I2C_ERROR_BUSY = 1,  // Expected not busy (both SCL and SDA high) - missing pull-ups?
    I2C_ERROR_ACK = 2,   // Expected ACK, none received before timeout
    I2C_ERROR_TIME_OUT = 3,
    I2C_ERROR_ADDR = 4
} I2C_ERROR;
// ----------------------------------------------------------------------------
#define I2C_BUSY_LOOPS                  100000
#define I2C_MASTER_MODE_LOOPS           100000
#define I2C_TRANSMIT_COMPLETE_LOOPS     100000
#define I2C_TRANSMIT_EMPTY_LOOPS        100000
#define I2C_MASTER_RECEIVER_LOOPS       100000
// ----------------------------------------------------------------------------
// Инициализация переферии I2C
void IIC_Init (uint16_t address);
// ----------------------------------------------------------------------------
// Получение последнего кода ошибки
uint32_t i2c_getLastError (void);
// ----------------------------------------------------------------------------
// Получение количества принятых/переданных байтов
uint16_t i2c_getBytesCount (void);
// ----------------------------------------------------------------------------
// Блочная/одиночная запись во внешнее устройство
uint32_t i2c_write (uint8_t i2c_address, uint8_t *data, uint8_t count);
// ----------------------------------------------------------------------------
// Чтение из внешнего устройства
uint32_t i2c_read (uint16_t i2c_address, uint8_t *data, uint8_t count);
// ----------------------------------------------------------------------------
// Поиск устройства на указанном адресе
uint32_t i2c_device_detect (uint16_t i2c_address);
// ----------------------------------------------------------------------------
// Сканирование шины I2C (только в режиме подключения по SDIO)
#ifdef USE_DEBUG_PRINT
void i2c_scan (void);
#endif
// ----------------------------------------------------------------------------
#pragma region Служебные методы для обслуживания модуля I2C
// ----------------------------------------------------------------------------
uint32_t i2c_wait_not_busy (void);
uint32_t i2c_wait_master_mode (void);
uint32_t i2c_wait_transmit_complete (void);

uint32_t i2c_begin_transaction(uint8_t per_hrdw_address, uint8_t direction);

uint32_t i2c_send_byte (uint8_t data);
uint8_t i2c_read_byte (void);
uint8_t i2c_read_byte_simple(void);
uint32_t I2C_WaitFlag (I2C_TypeDef *I2Cx, uint32_t I2C_FLAG);

void i2c_setACK (void);
void i2c_setNACK (void);
// ----------------------------------------------------------------------------
#pragma endregion
// ----------------------------------------------------------------------------
#endif /* __XC_I2C_H__ */
// ----------------------------------------------------------------------------
