/********************************** (C) COPYRIGHT *******************************
 * File Name          : sss_qucr.h
 * Author             : vantr
 * Version            : V1.0.0
 * Date               : 2025/12/28
 * Description        : Библиотека поддержки тактирования от внешних кварцев
 *********************************************************************************
 * Copyright (c) 2025 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе.
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_QUCR_LIB_H__
// -----------------------------------------------------------------------------
#define __SSS_QUCR_LIB_H__
// -----------------------------------------------------------------------------
/* ПЕРЕОПРЕДЕЛЕНИЕ КОНСТАНТЫ HSE_VALUE из ch32v00x.h

1. В файле "ch32v00x.h" исправьте секцию (19-21 строки)
#ifndef HSE_VALUE
#define HSE_VALUE                 ((uint32_t)20000000)
#endif

2. В файле "system_ch32v00x.c" (строки 20-25) сделайте выбор на "SYSCLK_FREQ_24MHz_HSE"
//#define SYSCLK_FREQ_8MHz_HSI    8000000
//#define SYSCLK_FREQ_24MHZ_HSI   HSI_VALUE
//#define SYSCLK_FREQ_48MHZ_HSI   48000000
//#define SYSCLK_FREQ_8MHz_HSE    8000000
#define SYSCLK_FREQ_24MHz_HSE   HSE_VALUE
//#define SYSCLK_FREQ_48MHz_HSE   48000000

// ------------------------------------------------------------------------------
Если сделали, как описано в секции выше, игнорируйте эту секцию!

Чтобы не править файл ch32v00x.h...

В дереве проекта нажмите правой кнопкой мыши на название вашего проекта и выберите Properties.
Перейдите в раздел: C/C++ Build → Settings.

На вкладке Tool Settings выберите: GNU RISC-V Cross C Compiler → Preprocessing.
В окне Defined symbols (-D) нажмите на иконку «плюс» (Add...).

Введите значение частоты кварца: HSE_VALUE=20000000 // Для кварца 20MHz к примеру

Нажмите Apply and Close.

Обязательно!!!: Сделайте Clean Project, а затем Build, чтобы все файлы перекомпилировались с новым значением.

*/
// ----------------------------------------------------------------------------
// Тип тактирования MCU
typedef enum {
    // Внутренний RC генератор 24MHz
    QUCR_SYSSRC_HSI = 0,
    // Внешний источник тактирования
    QUCR_SYSSRC_HSE,
    // Внешний источник через умножение
    QUCR_SYSSRC_PLL
} QUCR_SYS_SRC_Types;
// ----------------------------------------------------------------------------
// Выберите ОДИН подключенный кварц (для расчета латентности флеш-памяти)
// ----------------------------------------------------------------------------
// Используется кварц на 25MHz
//#define QUCR_FREQ_25
// ----------------------------------------------------------------------------
// Используется кварцы на /16/20/24 MHZ
#define QUCR_FREQ_16_20_24
// ----------------------------------------------------------------------------
// Используется кварц на 12MHZ
// #define QUCR_FREQ_12
// ----------------------------------------------------------------------------
// Если не используете умножение частоты кварца на 2 для шины, закомментируйте строку ниже!
// PLL нельзя использовать, если кварц > 24MHz
#ifndef QUCR_FREQ_25
#define QUCR_USE_PLL
#endif
// ----------------------------------------------------------------------------
QUCR_SYS_SRC_Types RCC_HSE_Configuration (void);
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------