/********************************** (C) COPYRIGHT ******************************
 * File Name          : matrix_engine.h
 * Author             : vantr
 * Version            : V1.0.8
 * Date               : 2026/04/22
 * Description        : Библиотека графики для OLED дисплея на SSD1306
 * Module             : Графическая библиотека MATRIX™
 *******************************************************************************
 * Поддержка GFX и потоковых/бинарных шрифтов
 *******************************************************************************
 * Copyright (c) 2025 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_MATRIXOLEDI2C__
// -----------------------------------------------------------------------------
#define __SSS_MATRIXOLEDI2C__
// -----------------------------------------------------------------------------
//#error "!!! КТО-ТО МЕНЯ ПОДКЛЮЧИЛ !!!"

#include "SSS_Common_Lib_V1/sss_classes.h"
#include "SSS_Common_Lib_V1/sss_graphics_common_types.h"
// -----------------------------------------------------------------------------
// Физические размеры устройства
#define DISPLAY_WIDTH   128
#define DISPLAY_HEIGHT  64
// -----------------------------------------------------------------------------
#define SSD1306_USE_MY_FONTS
// -----------------------------------------------------------------------------
// Рассчет необходимого размера буффера для указанного разрешения дисплея
#define matrix_HARDWARE_BUFFER_SIZE ((DISPLAY_HEIGHT * DISPLAY_WIDTH) / 8)
// -----------------------------------------------------------------------------
// Сдвиг кода символа при печати
#define MATRIX_SHIFT_SYMCODE        0x20
// Контекст отрисовки стандартного текста
typedef struct {
    uint8_t scale;
    WriteString_DirectionType direction;
    WriteString_WrapMode wrap_mode;
    WriteString_Align align;
    uint8_t space;
    uint8_t x_brush;
    uint8_t x_bg_transparent;
    int16_t x_caret;
    int16_t y_caret;
    uint8_t inverse;
} OLED_TextContext;
// -----------------------------------------------------------------------------
// Для управления контекстом
typedef enum {
    TX_Scale2,
    TX_Direction2,
    TX_Space2,
    TX_Wrap2,
    TX_Align2,
    TX_X_Caret2,
    TX_Y_Caret2,
    TX_Inverse2,
    TX_Brush2
} OLED_TextContextTypes;
// -----------------------------------------------------------------------------
// Обновление экрана V3 упрощенная адресация
// Используется при окончании отрисовки фрейма
void oled_matrix_refresh();
// -----------------------------------------------------------------------------
// Установка свойств контекста вывода строк стандартным шрифтом
void oled_matrix_set_textContext_prop(OLED_TextContextTypes prop_name, int16_t value);
// -----------------------------------------------------------------------------
// Установить цвет переднего плана
void oled_matrix_setBrush (uint8_t color);
// -----------------------------------------------------------------------------
// Установка флага прозрачности заднего плана
void oled_matrix_set_bg_transparent(uint8_t value);
// -----------------------------------------------------------------------------
// Посмотреть цвет переднего плана
uint8_t oled_matrix_getBrush();
// -----------------------------------------------------------------------------
// Посмотреть цвет заднего плана (инверсный цвету переднего плана)
uint8_t oled_matrix_getBackColor();
// -----------------------------------------------------------------------------
// Печать строки на индикатор, функция обновляет экран
void oled_matrix_writeString(uint8_t *str);
// -----------------------------------------------------------------------------
// Горизонтальная масштабируемая печать пропорциональным стандартным шрифтом
void oled_matrix_writeCharScaled (uint8_t sym);
// -----------------------------------------------------------------------------
// Вертикальная масштабируемая печать пропорциональным стандартным шрифтом
void oled_matrix_writeVCharUpScaled (uint8_t sym);
// -----------------------------------------------------------------------------
// Метод печати строки стандартным шрифтом в центр указанной области с центровкой и обрезкой (ellipsis) по границам области
void oled_matrix_drawStringInscribed_Smart (uint8_t *str, Rect area_owner);
// -----------------------------------------------------------------------------
// Вывод горизонтальной строки из указанного количества пикселей в текущую позицию каретки
void oled_matrix_writeHByte (uint8_t value, uint8_t length);
// -----------------------------------------------------------------------------
// Вывод вертикальной строки вниз из указанного количества пикселей в текущую позицию каретки
void oled_matrix_writeVByteDown(uint8_t value, uint8_t length);
// -----------------------------------------------------------------------------
// Вывод вертикальной строки вверх из указанного количества пикселей в текущую позицию каретки
void oled_matrix_writeVByteUp(uint8_t value, uint8_t length);
// -----------------------------------------------------------------------------
// Очистка физического и буфера экрана с обновлением
void oled_matrix_clearScreen();
// -----------------------------------------------------------------------------
// Очистка буфера и инициализация графики без изменения физического экрана
// Используется для начала рисования фрейма
void oled_matrix_frame_init();
// -----------------------------------------------------------------------------
// Установка области отрисовки дисплея
void oled_matrix_set_clientrect(Rect value);
// -----------------------------------------------------------------------------
// Получение области отрисовки экрана
Rect oled_matrix_get_clientrect();
// -----------------------------------------------------------------------------
// Проверка, попадает ли указанная точка в указанную область
uint8_t oled_matrix_point_in_rect(Point data, Rect rect);
// -----------------------------------------------------------------------------
// Проверка, попадает ли указанная точка в отрисовываемую область экрана
uint8_t oled_matrix_point_in_cliprect(uint8_t X, uint8_t Y);
// -----------------------------------------------------------------------------
// Рисование или гашение пикселя в указанной позиции буфера экрана [32x8], не обновляет экран
void oled_matrix_setPixel(uint8_t X, uint8_t Y, uint8_t Value);
// -----------------------------------------------------------------------------
// Возврат каретки в начальную, нулевую позицию
void oled_matrix_returnCaret();
// -----------------------------------------------------------------------------
// Установка каретки в любое указанное положение [-127...127]
void oled_matrix_setCaret(int16_t value);
// -----------------------------------------------------------------------------
// Сдвиг каретки на указанное количество пикселей [-127...127]
void oled_matrix_addCaret(int16_t value);
// -----------------------------------------------------------------------------
// Установка каретки в указанные координаты матрицы
void oled_matrix_setCoord(int16_t X, int16_t Y);
// -----------------------------------------------------------------------------
// Установка каретки в указанные координаты матрицы
void oled_matrix_setCoord2(Point data);
// -----------------------------------------------------------------------------
// Установка отступа по вертикали
void oled_matrix_setMargin(int16_t value);
// -----------------------------------------------------------------------------
// Инверсия содержимого экрана
void oled_matrix_inverseScreen();
// -----------------------------------------------------------------------------
// Скроллинг экрана на одну позицию влево
void oled_matrix_scrollLeft();
// -----------------------------------------------------------------------------
// Рассчет длины указанной строки в пикселях
Size oled_matrix_measureString (uint8_t *str);
// -----------------------------------------------------------------------------
// Вывод пользовательского символа указанного размера [64x8]
void oled_matrix_writeCustomChar(uint8_t *image, uint8_t width, uint8_t height);
// -----------------------------------------------------------------------------
// Вывод пользовательского символа указанного размера до [64x16]
void oled_matrix_writeLargeCustomChar(uint16_t *image, uint8_t width, uint8_t height);
// -----------------------------------------------------------------------------
// Вывод пользовательского изображения до [64x32]
void oled_matrix_writeBitmap(uint32_t *image, uint8_t height);
// -----------------------------------------------------------------------------
// Вывод пользовательского изображения до [64x32]
void oled_matrix_writeBitmapEx (const uint8_t *bitmap, uint8_t width, uint8_t height);
// -----------------------------------------------------------------------------
// Печать одного символа бинарного шрифта
void oled_matrix_writeCharBin (const uint8_t ch, const BINFont *font, float line_spacing);
// -----------------------------------------------------------------------------
// Печать строки символами двоичного шрифта
void oled_matrix_writeStringBin(const uint8_t *str, const BINFont *font, float line_spacing);
// -----------------------------------------------------------------------------
// Измерение длины строки BIN
Size oled_matrix_measureStringBin (const uint8_t *str, const BINFont *font);
// -----------------------------------------------------------------------------
// Печать символов из шрифтов GFX
void oled_matrix_drawString_GFX2X (const uint8_t *str, const GFXfont *font, float line_spacing);
// -----------------------------------------------------------------------------
// Заливка указанного прямоугольника, функция не обновляет экран
void oled_matrix_fill_rect (Rect area, uint8_t value);
// -----------------------------------------------------------------------------
// Заливка указанного прямоугольника, функция не обновляет экран
void oled_matrix_fill_rect2(uint8_t x, uint8_t y, uint8_t w, uint8_t h, uint8_t value);
// -----------------------------------------------------------------------------
// Создание точки из координат
Point oled_matrix_create_point(uint8_t X, uint8_t Y);
// -----------------------------------------------------------------------------
// Создание структуры размера из данных
Size oled_matrix_create_size(uint8_t width, uint8_t height);
// -----------------------------------------------------------------------------
// Создание прямоугольной области
Rect oled_matrix_create_rect(Point coords, Size client_size);
// -----------------------------------------------------------------------------
// Создание прямоугольной области
Rect oled_matrix_create_rect2(uint8_t X, uint8_t Y, uint8_t Width, uint8_t Height);
// -----------------------------------------------------------------------------
// Рисование линии по алгоритму Брезенхейма
void oled_matrix_line(int x0, int y0, int x1, int y1);
// -----------------------------------------------------------------------------
// Рисование линии по алгоритму Брезенхейма
void oled_matrix_line2(Point A1, Point A2);
// -----------------------------------------------------------------------------
// Рисование окружности методом Брезенхейма
void oled_matrix_circle(int x0, int y0, int radius, uint8_t fill);
// -----------------------------------------------------------------------------
// Рисование окружности методом Брезенхейма
void oled_matrix_circle2(Point data, uint8_t fill);
// -----------------------------------------------------------------------------
// Рисование полигона из произвольного количества отрезков (больше одного)
void oled_matrix_polygon(Point *data, uint8_t count, uint8_t closed);
// -----------------------------------------------------------------------------
// Построение заштрихованного прямоугольника
void oled_matrix_filled_rect(Point data, Size size);
// -----------------------------------------------------------------------------
// Сдвиг указанных координат на указанный диапазон [-127..127]
Point oled_matrix_shift_coords(Point data, int8_t X, int8_t Y);
// -----------------------------------------------------------------------------
// Рисование простой рамки указанного размера
void oled_matrix_draw_rect(Point data, Size size);
// -----------------------------------------------------------------------------
// Рисование простой рамки указанного размера
void oled_matrix_draw_rect2(Rect area);
// -----------------------------------------------------------------------------
// Рамка в один пиксель по краям дисплея
void oled_matrix_client_rect();
// -----------------------------------------------------------------------------
// Получение координат верхнего правого угла прямоугольной области
Point oled_matrix_get_rect_topright(Rect rect);
// -----------------------------------------------------------------------------
// Получение координат верхнего правого угла прямоугольной области
Point oled_matrix_get_rect_bottomright(Rect rect);
// -----------------------------------------------------------------------------
// Получение координат верхнего правого угла прямоугольной области
Point oled_matrix_get_rect_bottomleft(Rect rect);
// -----------------------------------------------------------------------------
// Пропорционально уменьшить прямоугольную область
Rect oled_matrix_reduce_rect(Rect rect, uint8_t value);
// -----------------------------------------------------------------------------
// Пропорционально уменьшить прямоугольную область на один пиксель
Rect oled_matrix_reduce_rect2(Rect rect);
// -----------------------------------------------------------------------------
// Пропорционально увеличить прямоугольную область
Rect oled_matrix_increase_rect(Rect rect, uint8_t value);
// -----------------------------------------------------------------------------
// Вычисление области пересечения двух областей
Rect oled_matrix_rect_intersect (Rect r1, Rect r2);
// -----------------------------------------------------------------------------
// Проверка, является ли указанная область пустой
uint8_t oled_matrix_rect_isEmpty (Rect area);
// -----------------------------------------------------------------------------
// Получение координат углов указанной области
Point oled_matrix_get_corner (Rect area, Corner subject);
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------
