// ----------------------------------------------------------------------------
// Глобальные настройки проекта для CH32V003 MEGAPACK
// ----------------------------------------------------------------------------
#ifndef __APP_CONFIG_H__
#define __APP_CONFIG_H__
// ----------------------------------------------------------------------------
// ******************************************************************************************

#include "ch32v00x.h"
#include "SSS_Common_Lib_V1/sss_classes.h"
// ----------------------------------------------------------------------------
// Набор оборудования проекта, закомментируйте ненужное, добавьте нужное
// ----------------------------------------------------------------------------
// ⚠️ Подключая драйвера здесь, включайте пакет этого драйвера в сборку в панели "Explorer" -
// "Include/Exclude From Build", и отключайте пакеты при отключении оборудования в этом файле!
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется транспорт для внешних связей
//#define USE_TRANSPORT_UART
// ----------------------------------------------------------------------------
// ⚠️ Использовать SPI шину для подключения устройств
#define USE_SPI_DEVICES
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется шина I2C
// #define USE_I2C
// ----------------------------------------------------------------------------
// Скорость порта для обмена (921600 - максимум для моста USB CH340) и отладки
#define UART_WORK_BAUDRATE              921600
// ----------------------------------------------------------------------------
#ifdef USE_SPI_DEVICES
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется флеш память серии W25Q
#define USE_FLASH_W25Q
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется TFT SPI дисплей ОСНОВНОЙ
#define USE_TFT_ST7789
// ----------------------------------------------------------------------------
#ifdef USE_TFT_ST7789
// ⚠️ Использует ли дисплей сигнал RST
// #define USE_TFT_ST7789_RST
#endif
// ----------------------------------------------------------------------------
#ifndef USE_TFT_ST7789
// В проекте используется графический OLED SPI дисплей SSD1306 (7pin) ОСНОВНОЙ
//#define USE_OLED_SSD1306
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306
// Использует ли дисплей сигнал RST
//#define USE_OLED_SSD1306_RST
#endif
#endif
#endif
// ----------------------------------------------------------------------------
#ifdef USE_I2C
// В проекте используется текстовый OLED I2C дисплей SSD1306 (I2C адаптер)
// Модуль "SSS_SSD1306_TXT_V5"
// Может быть использован совместно с графическим SPI дисплеем
// #define USE_OLED_SSD1306_TXT_I2C
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется графический OLED I2C дисплей SSD1306 (I2C адаптер)
// Модуль "SSD1306_GR_I2CHW_V6"
// Может быть использован совместно с графическим SPI дисплеем
#define USE_OLED_SSD1306_GR6_I2C
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется графический LCD I2C дисплей ST920 (128x64, I2C адаптер)
// #define USE_LCD_ST920
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется LCD 1602A через I2C адаптер
// #define USE_LCD1602_I2C
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется DAC MCP4725
// #define USE_DAC_MCP4725
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется контроллер 7-сегментных индикаторов I2C
// #define USE_HT16K33
// ----------------------------------------------------------------------------
#endif /* USE_I2C */
// ----------------------------------------------------------------------------
// Если используются измерения постоянного напряжения, подключите библиотеку <SSS_ADC_SimpleLib_V1>.
// ⚠️ Внимание! В этом оборудовании доступны каналы A0-A3 при условии, что их не занимает другое оборудование.
// Библиотека в настройках не нуждается. Перед измерением один раз запустите метод "ADC_PowerSafe_Init();"
// #define USE_ADC_Measure
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется датчик IR (протокол NEC)
// #define USE_IR_NEC
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется синтезатор звука
#define USE_SOUND_GEN
// ----------------------------------------------------------------------------
// ⚠️ Проект использует PWM генерацию (таймер TIM2)
//#define USE_PWM
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется энкодер EC11
#define USE_ENCODER_EC11
// ----------------------------------------------------------------------------
// ⚠️ В проекте используется драйвер датчиков DS18B20
// #define USE_DS18B20
// ----------------------------------------------------------------------------

// ----------------------------------------------------------------------------
// Выбор транспорта (Hardware/Software)
// ----------------------------------------------------------------------------
// ОСТАВЬТЕ ТОЛЬКО ОДИН НУЖНЫЙ!
#define USE_SPI_HARDWARE
//#define USE_SPI_SOFTWARE
// ----------------------------------------------------------------------------
// Выберите, где будет инициализироваться SPI
// -- Если используется Flash-память, то инициализировать SPI должен её драйвер!
// ОСТАВЬТЕ ТОЛЬКО ОДИН НУЖНЫЙ!
#define FLASH_INIT_SPI
// #define TFT_INIT_SPI
// #define OLED_INIT_SPI
// ----------------------------------------------------------------------------
// Константы для идентификации оборудования
#define CONST_HARDWARE_NAME             "MOD-PCB4-V003"
#define CONST_HARDWARE_VERSION          "H1.0"
#define CONST_SOFTWARE_VERSION          "S1.0"
//  ----------------------------------------------------------------------------

//  ----------------------------------------------------------------------------
// ⚠️ Три параметра ниже влияют на расход оперативной памяти!
//  Допустимое количество байт в списке sss_byteList (byte[])
#define LIST_MAX_SIZE                   64
// ----------------------------------------------------------------------------
// Максимально допустимое количество пунктов в меню приложения
#define MENU_MAX_ITEMS                  16
// ----------------------------------------------------------------------------
// Максимальный уровень погружения - вложенности меню!
#define MAX_MENU_LEVELS                 8
//  ----------------------------------------------------------------------------

// ******************************************************************************************

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки аппаратного USART для связи с ББ
// ----------------------------------------------------------------------------
#ifdef USE_TRANSPORT_UART
// ----------------------------------------------------------------------------
#define USART_DEV                       USART1

#define USART_IRQ                       USART1_IRQn
#define USART_RCC                       RCC_APB2Periph_USART1
#define USART_HANDLER                   USART1_IRQHandler
// ----------------------------------------------------------------------------
static const PinDefine_t USART_TX_PORT = {  // PD5
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_5
};
// ----------------------------------------------------------------------------
static const PinDefine_t USART_RX_PORT = {  // PD6
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_6
};
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

#ifdef USE_SPI_DEVICES
// ----------------------------------------------------------------------------
// Настройки аппаратного SPI
// ----------------------------------------------------------------------------
#ifdef  USE_SPI_HARDWARE
// ----------------------------------------------------------------------------
// Если SPI должен поддерживать полный дуплекс, раскомментируйте этот флаг!
#define SPIHW_FULL_DUPLEX
// ----------------------------------------------------------------------------
// Используется ли переназначение портов для SPI
//#define SPI_USE_REMAP
// ----------------------------------------------------------------------------
#define SPIHW_DEVICE                    SPI1
#define SPIHW_RCC                       RCC_APB2Periph_SPI1
// ----------------------------------------------------------------------------
#ifdef SPI_USE_REMAP
#define SPI_REMAP() GPIO_PinRemapConfig (GPIO_PartialRemap2_SPI1, ENABLE)   // Default

// Порт SPI Default (для CH32V003 SSOP20)
// ----------------------------------------------------------------------------
static const PinDefine_t SPIHW_MOSI_PORT = {  // PA10
    .rcc =                              RCC_APB2Periph_GPIOA,
    .port =                             GPIOA,
    .pin =                              GPIO_Pin_10
};
// ----------------------------------------------------------------------------
static const PinDefine_t SPIHW_MISO_PORT = {  // PA9
    .rcc =                              RCC_APB2Periph_GPIOA,
    .port =                             GPIOA,
    .pin =                              GPIO_Pin_9
};
// ----------------------------------------------------------------------------
static const PinDefine_t SPIHW_SCK_PORT = {  // PA11
    .rcc =                              RCC_APB2Periph_GPIOA,
    .port =                             GPIOA,
    .pin =                              GPIO_Pin_11
};
// ----------------------------------------------------------------------------
#else
// Порт SPI Default (для CH32V003 SSOP20)
static const PinDefine_t SPIHW_MOSI_PORT = {  // PC6
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_6
};
// ----------------------------------------------------------------------------
static const PinDefine_t SPIHW_MISO_PORT = {  // PC7
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_7
};
// ----------------------------------------------------------------------------
static const PinDefine_t SPIHW_SCK_PORT = {  // PC5
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_5
};
#endif
// ----------------------------------------------------------------------------
#endif /* USE_SPI_HARDWARE */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки программного SPI
// ----------------------------------------------------------------------------
#ifdef  USE_SPI_SOFTWARE
// ----------------------------------------------------------------------------
// Если софтверный SPI должен поддерживать полный дуплекс, раскомментируйте этот флаг!
#define SPISW_FULL_DUPLEX
// ----------------------------------------------------------------------------
// 1. Выбор режима (ОСТАВЬТЕ ТОЛЬКО ОДИН)
// #define SPISW_MODE_1
#define SPISW_MODE_3
// ----------------------------------------------------------------------------
// ЗАКОММЕНТИРУЙ ЭТО, чтобы выжать максимум скорости (для W25Q32 / Экранов)
// РАСКОММЕНТИРУЙ ЭТО, если нужна работа с медленной периферией через SetSpeed()
//#define SPISW_USE_DELAY
// ----------------------------------------------------------------------------
// Определяем физические адреса портов и номера пинов программного SPI
// ----------------------------------------------------------------------------
static const PinDefine_t SPISW_SCK_PORT = {  // PC5
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_5
};
// ----------------------------------------------------------------------------
static const PinDefine_t SPISW_MOSI_PORT = {  // PC6
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_6
};
// ----------------------------------------------------------------------------
#ifdef SPISW_FULL_DUPLEX
static const PinDefine_t SPISW_MISO_PORT = {  // PC7
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_7
};
#endif
// ----------------------------------------------------------------------------
#endif /* USE_SPI_SOFTWARE */
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки PWM
// ----------------------------------------------------------------------------
#ifdef USE_PWM
// ----------------------------------------------------------------------------
#define PWM_USE_TIM1
//#define PWM_USE_TIM2
// ----------------------------------------------------------------------------
#ifdef PWM_USE_TIM1
// Определение, какие каналы PWM используются. Таймер TIM1
// Пины указаны для варианта корпуса TSSOP20 (ремап по умолчанию)
#define PWM_USE_CH_1  // PD2
//#define PWM_USE_CH_2  // PA1 ! ⚠️ ТОЛЬКО ЕСЛИ НЕ ИСПОЛЬЗУЕТСЯ КВАРЦ!
#define PWM_USE_CH_3  // PC3
#define PWM_USE_CH_4  // PC4
// ----------------------------------------------------------------------------
#ifdef PWM_USE_CH_1
static const PinDefine_t PWM1_PORT = {  // PD2
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_2
};
#endif
#ifdef PWM_USE_CH_2
static const PinDefine_t PWM2_PORT = {  // PA1
    .rcc =                              RCC_APB2Periph_GPIOA,
    .port =                             GPIOA,
    .pin =                              GPIO_Pin_1
};
#endif
#ifdef PWM_USE_CH_3
static const PinDefine_t PWM3_PORT = {  // PC3
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_3
};
#endif
#ifdef PWM_USE_CH_4
static const PinDefine_t PWM4_PORT = {  // PC4
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_4
};
#endif
#endif
// ----------------------------------------------------------------------------
#ifdef PWM_USE_TIM2
// Определение, какие каналы PWM используются. Таймер TIM1
// Пины указаны для варианта корпуса TSSOP20 (ремап по умолчанию)
#define PWM_USE_CH_1  // PD4
#define PWM_USE_CH_2  // PD3
#define PWM_USE_CH_3  // PC0
#define PWM_USE_CH_4  // PD7
// ----------------------------------------------------------------------------
#ifdef PWM_USE_CH_1
static const PinDefine_t PWM1_PORT = {  // PD4
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_4
};
#endif
#ifdef PWM_USE_CH_2
static const PinDefine_t PWM2_PORT = {  // PD3
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_3
};
#endif
#ifdef PWM_USE_CH_3
static const PinDefine_t PWM3_PORT = {  // PC0
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_0
};
#endif
#ifdef PWM_USE_CH_4
static const PinDefine_t PWM4_PORT = {  // PD7
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_7
};
#endif
#endif
// -----------------------------------------------------------------------------
// -----------------------------------------------------------------------------
// Таблица готовых значений ARR при Fsys=48МГц
// ***********************************************************
// *    Частота PWM     |  PSC  |  ARR  | Разрешение (шагов) *
// ***********************************************************
// *  100 kHz           |   0   |  479  |        480         *
// *  20 kHz            |   0   | 2399  |       2400         *
// *  10 kHz            |   0   | 4799  |       4800         *
// *  1 kHz             |  47   |  999  |       1000         *
// *  50 Hz (servo)     |  47   | 19999 |      20000         *
// ***********************************************************
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки I2C
// ----------------------------------------------------------------------------
#ifdef USE_I2C
// ⚠️ ВНИМАНИЕ! I2C здесь только в Default карте пинов!
// ----------------------------------------------------------------------------
// Собственный адрес мастера шины
#define I2C_SELF_ADDRESS                0x02
// ----------------------------------------------------------------------------
// Допустимые режимы работы по скорости шины (оставьте один!)
//#define I2C_SPEED_STANDARD_MODE         100000
#define I2C_SPEED_FAST_MODE             400000
//#define I2C_SPEED_FAST_MODE_PLUS        1000000
// ----------------------------------------------------------------------------
static const PinDefine_t I2C_SDA_PORT = {  // PC1
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_1
};
// ----------------------------------------------------------------------------
static const PinDefine_t I2C_SCL_PORT = {  // PC2
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_2
};
// ----------------------------------------------------------------------------
#endif  /* USE_I2C */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки OLED SSD1306 I2C текстовый
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306_TXT_I2C
// ----------------------------------------------------------------------------
// I2C адрес чипа на шине
#define SSD1306_CHIP_SAVEADDR           0x78
// -----------------------------------------------------------------------------
// ВНИМАНИЕ!!! Физический размер матрицы, оставьте только один!
// Правится пользователем!
// #define SSD1306_DISPLAY_DIMENSIONS_128X32
#define SSD1306_DISPLAY_DIMENSIONS_128X64
// -----------------------------------------------------------------------------
// Использовать новый вариант инициализации (освобождает 10 байт)
// #define SSD1306_USE_NEW_INIT
// -----------------------------------------------------------------------------
// Использовать шрифт из внешнего EEPROM!
// Если фонты находятся в FONTS.h, закомментируйте это!
// #define SSD1306_USE_EEPROM_FONTS
// -----------------------------------------------------------------------------
// Разрешить методы расширенной печати
#define SSD1306_USE_PRINTEX
// -----------------------------------------------------------------------------
// Если используется мой набор фонтов, раскомментируйте этот флаг для того,
// чтобы можно было использовать кириллицу прямо в тексте программ для вывода
// на экран. Внимание! Текст должен быть кодирован в UTF8!
#define SSD1306_USE_MY_FONTS
// -----------------------------------------------------------------------------
#ifdef SSD1306_USE_EEPROM_FONTS
// Максимальный индекс загружаемого символа
// В стандартном наборе vantr - 160 символов
#define SYMBOLS_COUNT_IN_EPROM 203
// -----------------------------------------------------------------------------
// Физический адрес [A0-A2] чипа на шине I2C
#define EEPROM_PHY_ADDR 0
#endif
// ----------------------------------------------------------------------------
#endif /* USE_OLED_SSD1306_TXT_I2C */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки FTF ST7789 SPI графический
// ----------------------------------------------------------------------------
#ifdef USE_TFT_ST7789
// ----------------------------------------------------------------------------
// Определяем пины управления TFT дисплеем
// ----------------------------------------------------------------------------
static const PinDefine_t ST7789_SC_PORT = {  // PC0
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_0
};
// ----------------------------------------------------------------------------
static const PinDefine_t ST7789_DC_PORT = {  // PC3
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_3
};
// ----------------------------------------------------------------------------
#ifdef USE_TFT_ST7789_RST
static const PinDefine_t ST7789_RST_PORT = {  // PB2 (заглушка)
    .rcc =                              RCC_APB2Periph_GPIOB,
    .port =                             GPIOB,
    .pin =                              GPIO_Pin_100
};
#endif
// ----------------------------------------------------------------------------
#endif /* USE_TFT_ST7789 */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки OLED SSD1306 SPI графический
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306
// ----------------------------------------------------------------------------
// Определяем пины управления OLED дисплеем
// ----------------------------------------------------------------------------
static const PinDefine_t SSD1306_SC_PORT = {  // PC0
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_0
};
// ----------------------------------------------------------------------------
static const PinDefine_t SSD1306_DC_PORT = {  // PC3
    .rcc =                              RCC_APB2Periph_GPIOC,
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_3
};
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306_RST
static const PinDefine_t SSD1306_RST_PORT = {  // PB2 (заглушка)
    .rcc =                              RCC_APB2Periph_GPIOB,
    .port =                             GPIOB,
    .pin =                              GPIO_Pin_100
};
#endif
// ----------------------------------------------------------------------------
#endif /* USE_OLED_SSD1306 */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки OLED SSD1306 I2C графический
// ----------------------------------------------------------------------------
#ifdef USE_OLED_SSD1306_GR6_I2C
// -----------------------------------------------------------------------------
// ВНИМАНИЕ!!! Физический размер матрицы, оставьте только один!
// Правится пользователем!
// #define SSD1306_DISPLAY_DIMENSIONS_128X32
#define SSD1306_DISPLAY_DIMENSIONS_128X64
// ----------------------------------------------------------------------------
// I2C адрес чипа на шине
#define SSD1306_CHIP_SAVEADDR           0x78
// -----------------------------------------------------------------------------
// Использовать новый вариант инициализации (освобождает 10 байт)
// #define SSD1306_USE_NEW_INIT
// -----------------------------------------------------------------------------
// Использовать шрифт из внешнего EEPROM!
// Если фонты находятся в FONTS.h, закомментируйте это!
// #define SSD1306_USE_EEPROM_FONTS
// -----------------------------------------------------------------------------
#ifdef SSD1306_USE_EEPROM_FONTS
// Максимальный индекс загружаемого символа
// В стандартном наборе vantr - 160 символов
#define SYMBOLS_COUNT_IN_EPROM 197
// -----------------------------------------------------------------------------
// Физический адрес [A0-A2] чипа на шине I2C
#define EEPROM_PHY_ADDR 0
#endif
// ----------------------------------------------------------------------------
#endif /* USE_OLED_SSD1306_GR6_I2C */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки Энкодера EC11
// ----------------------------------------------------------------------------
#ifdef USE_ENCODER_EC11
// ----------------------------------------------------------------------------
// Определяем пины управления Энкодером
// ----------------------------------------------------------------------------
// Если кнопка энкодера не используется, закомментируйте строку ниже
#define ENC_EC11_USE_BUTTON
// -----------------------------------------------------------------------------
// Line A
// ⚠️ ВНИМАНИЕ ДЛЯ CH32X033: Пины для линии A брать строго от 0 до 7!
static const ExtPinDefine_t ENC_EC11_A = { // PD0
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_0,
    .rcc =                              RCC_APB2Periph_GPIOD,
    .exti_port_src =                    GPIO_PortSourceGPIOD,
    .exti_pin_src =                     GPIO_PinSource0,
    .exti_line =                        EXTI_Line0
};
// -----------------------------------------------------------------------------
// Line B
static const PinDefine_t ENC_EC11_B = {  // PD2
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_2
};
// -----------------------------------------------------------------------------
#ifdef ENC_EC11_USE_BUTTON
// Line for Button
static const PinDefine_t ENC_EC11_BUTTON = {  // PD7
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_7
};
#endif
// ----------------------------------------------------------------------------
#endif /* USE_ENCODER_EC11 */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки звука
// ----------------------------------------------------------------------------
#ifdef USE_SOUND_GEN
// ----------------------------------------------------------------------------
// Настройки воспроизведения звука TIM2
// ----------------------------------------------------------------------------
// Задержка для формирования частоты семплирования синтезатора
#define SOUND_FM_DELAY_US               125  // Сэмплы 8000Гц
// ----------------------------------------------------------------------------
// Настройка аудио-выхода: задаем регистр сравнения для нужного канала
// Выбор ОДНОГО канала, настроенного на выход для генерации звука
#define AUDIO_PWM_REG (TIM2->CH1CVR)
// ----------------------------------------------------------------------------
// Это пин для выхода ШИМ
static const PinDefine_t SND_OUT_PORT = {  // TIM2:CH1 - PD4
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_4
};
// ----------------------------------------------------------------------------
#endif /* USE_SOUND_GEN */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки IR (протокол NEC)
// ----------------------------------------------------------------------------
#ifdef USE_IR_NEC
// ----------------------------------------------------------------------------
// Порт для линии IR (используется прерывание)
// ----------------------------------------------------------------------------
// ⚠️ ВНИМАНИЕ ДЛЯ CH32V033: Отраничения пока не установлены
static const ExtPinDefine_t IR_NEC_PORT = {  // PC3
    .port =                             GPIOC,
    .pin =                              GPIO_Pin_3,
    .rcc =                              RCC_APB2Periph_GPIOC,
    .exti_port_src =                    GPIO_PortSourceGPIOC,
    .exti_pin_src =                     GPIO_PinSource3,
    .exti_line =                        EXTI_Line3
};
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройка DS18B20
// ----------------------------------------------------------------------------
#ifdef USE_DS18B20
// ----------------------------------------------------------------------------
// Это пин для подключения датчиков
static const PinDefine_t ONEWARE_PORT = {  // PD0
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_0
};
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки DAC MCP4725
// ----------------------------------------------------------------------------
#ifdef USE_DAC_MCP4725
// ----------------------------------------------------------------------------
// Флаг разрешения полного режима передачи
#define DAC_FULLMODE_ENABLED
// -----------------------------------------------------------------------------
// Максимальное значение на выходе схемы (для блоков питания), mV
#define HARDWARE_VOLTAGE_MAX            3300
// -----------------------------------------------------------------------------
// Питание DAC в милливольтах для расчета значений установки напряжения
// Чем точнее будет указано это значение, тем точнее будет выходное напряжение
#define U_REF_VALUE                     3300  // mV
// -----------------------------------------------------------------------------
// Коррекция падения напряжения на выходных ключах (mV)
#define U_OUT_CORRECT                   0
// -----------------------------------------------------------------------------
// Аппаратный адрес DAC
// -----------------------------------------------------------------------------
// MCP4725A1T-E/CH
//                                                 ----AAA-
//                                                 HHHH210M
#define HA_MCP4725                      0xC4  // 0b11000100 (это на реальный чип)
// #define HA_MCP4725                   0xC0 // 0b11000000 (это для симуляции в Proteus)
//  ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройка LCD1602A через I2C адаптер
// ----------------------------------------------------------------------------
#ifdef USE_LCD1602_I2C
// ----------------------------------------------------------------------------
// Раскомментируйте строку, если дисплей четырехстрочный!
// #define DISPLAY_IS_2004
// -----------------------------------------------------------------------------
// Выбор конструкции модуля. Оставьте только один!
#define USE_CHINESE_I2C_MODULE
// #define USE_MY_I2C_MODULE
// #define USE_MY_NEW_3V_MODULE
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройка ST920 через I2C адаптер
// ----------------------------------------------------------------------------
#ifdef USE_LCD_ST920
// ----------------------------------------------------------------------------
// Выбор конструкции модуля. Оставьте только один!
// #define USE_CHINESE_I2C_MODULE
// #define USE_MY_I2C_MODULE
#define USE_MY_NEW_3V_MODULE
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройка HT16K33 I2C
// ----------------------------------------------------------------------------
// ⚠️ Внимание! Если используются нестандартные адреса знакомест, правьте массив HT_DIGITS_ADDRESS в файле HT16K33.h
// ----------------------------------------------------------------------------
#ifdef USE_HT16K33
// ----------------------------------------------------------------------------
// Адрес первого чипа на шине I2C
#define HT16K33_I2C_ADDR                0xE0  // 28-pin корпус
// -----------------------------------------------------------------------------
// Номер чипа на
#define HT16K33_CHIP_NUMBER             0
// -----------------------------------------------------------------------------
// Номер бита для представления децимальной точки
#define HT_DP_BIT                       7
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
// Настройки W25Q
// ----------------------------------------------------------------------------
#ifdef USE_FLASH_W25Q
// ----------------------------------------------------------------------------
// Если не используете вывод дебага, закомментируйте этот флаг
//#define USE_W25Q_DEBUG
// ----------------------------------------------------------------------------
// Настройка параметров массива флеш-памяти производится в файле hardware.h библиотеки SSS_W25Qxx_Lib_1
// ----------------------------------------------------------------------------
#define W25Q_CHUNK_SIZE                 32   // Количество памяти для индексации поиска файлов
// ----------------------------------------------------------------------------
// Это пин для CS сигнала расширения SPI для флеш-памяти
static const PinDefine_t W25Q_SC_PORT = {      // PD3
    .rcc =                              RCC_APB2Periph_GPIOD,
    .port =                             GPIOD,
    .pin =                              GPIO_Pin_3
};
// ----------------------------------------------------------------------------
#endif /* USE_FLASH_W25Q */
// ----------------------------------------------------------------------------

// ******************************************************************************************

// ----------------------------------------------------------------------------
#endif /* SPI_CONFIG_H */
// ----------------------------------------------------------------------------