/********************************** (C) COPYRIGHT *******************************
 * File Name          : HT16K33.h
 * Author             : vantr
 * Version            : V2.0.0
 * Description        : Общая библиотека
 *********************************************************************************
 * Copyright (c) 2025 Vantr Universal Co., Ltd.
 *******************************************************************************/
// -----------------------------------------------------------------------------
#include "HT16K33.h"
#include "SSS_I2CHW_MLib_V4.4/i2c.h"
#include "SSS_Common_Lib_V1/sss_classes.h"
#include "symbols.h"
// -----------------------------------------------------------------------------
uint32_t ht_last_error = I2C_ERROR_SUCCESS;
// -----------------------------------------------------------------------------
// Создание адреса из физического адреса устройства и номера чипа (A0-A2)
uint8_t HT16K33_GetAddress(uint8_t chip_number) {
    
    uint8_t ack_temp = ((chip_number & 0x07) << 1);
    
    return (HT16K33_I2C_ADDR | ack_temp);
}
// -----------------------------------------------------------------------------
// Ввод произвольного адреса
// chip_number  - номер чипа на шине (A0-A2)
// mode         - режим (0 - запись, 1 - чтение)
uint32_t HT16K33_SetHeader(uint8_t chip_number, uint8_t mode) {
    // -------------------------------------------------------------------------
    uint8_t da = HT16K33_GetAddress(chip_number);
    // -------------------------------------------------------------------------
    switch (mode) {
        
        case 1:            
            sbi(da, 0);
            break;
            
        default:
            cbi(da, 0);
            break;
    }
    // -------------------------------------------------------------------------
    ht_last_error = i2c_begin_transaction (HT16K33_I2C_ADDR, da);
    // -------------------------------------------------------------------------
    return ht_last_error;
    // -------------------------------------------------------------------------
}
// -----------------------------------------------------------------------------
// Загрузка в драйвер адреса для чтения или записи
// chip_number  - номер чипа на шине (A0-A2)
// address - загружаемый адрес
uint32_t HT16K33_SetAddress(uint8_t chip_number, uint8_t address) {
    // -------------------------------------------------------------------------
    ht_last_error = HT16K33_SetHeader(chip_number, I2C_WRITE);
    // -------------------------------------------------------------------------
    if (ht_last_error != I2C_ERROR_SUCCESS) {

        // Заканчиваем цикл передачи данных
        I2C_GenerateSTOP( I2C1, ENABLE );
        
        return ht_last_error;
    }
    // -------------------------------------------------------------------------
    ht_last_error = i2c_send_byte(address);
    // -------------------------------------------------------------------------
    return ht_last_error;
    // -------------------------------------------------------------------------
}
// -----------------------------------------------------------------------------
// Запись указанной команды в порт
// chip_number  - номер чипа на шине (A0-A2)
uint32_t HT16K33_WriteCMD(uint8_t chip_number, uint8_t data) {
    // -------------------------------------------------------------------------
    ht_last_error = HT16K33_SetHeader(chip_number, I2C_WRITE);
    // -------------------------------------------------------------------------
    if (ht_last_error != I2C_ERROR_SUCCESS) {

        // Заканчиваем цикл передачи данных
        I2C_GenerateSTOP( I2C1, ENABLE );
        
        return ht_last_error;
    }
    // -------------------------------------------------------------------------
    ht_last_error = i2c_send_byte(data);
    // -------------------------------------------------------------------------
    // Заканчиваем цикл передачи данных
    I2C_GenerateSTOP( I2C1, ENABLE );
    // -------------------------------------------------------------------------
    return ht_last_error;
    // -------------------------------------------------------------------------
}
// -----------------------------------------------------------------------------
// Запись указанных данных по адресу
// chip_number  - номер чипа на шине (A0-A2)
// address      - адрес в чипе
// Выход: 0 - успешно, 1 - сбой
uint8_t HT16K33_Write(uint8_t chip_number, uint8_t address, uint8_t data) {
    // -------------------------------------------------------------------------
    ht_last_error = HT16K33_SetAddress(chip_number, address);
    // -------------------------------------------------------------------------
    if (ht_last_error != I2C_ERROR_SUCCESS) {

        // Заканчиваем цикл передачи данных
        I2C_GenerateSTOP( I2C1, ENABLE );
        
        return ht_last_error;
    }
    // -------------------------------------------------------------------------
    ht_last_error = i2c_send_byte(data);
    // -------------------------------------------------------------------------
    // Заканчиваем цикл передачи данных
    I2C_GenerateSTOP( I2C1, ENABLE );
    // -------------------------------------------------------------------------
    return ht_last_error;
    // -------------------------------------------------------------------------
}
// -----------------------------------------------------------------------------
// Чтение указанного значения из драйвера
uint8_t HT16K33_Read(uint8_t chip_number, uint8_t address, uint8_t default_result) {
    // -------------------------------------------------------------------------
    ht_last_error = HT16K33_SetAddress(chip_number, address);
    // -------------------------------------------------------------------------
    // Заканчиваем цикл передачи данных
    I2C_GenerateSTOP( I2C1, ENABLE );
    // -------------------------------------------------------------------------
    if (ht_last_error != I2C_ERROR_SUCCESS) {

        return default_result;
    }
    // -------------------------------------------------------------------------
    ht_last_error = HT16K33_SetHeader(chip_number, I2C_READ);
    // -------------------------------------------------------------------------
    if (ht_last_error != I2C_ERROR_SUCCESS) {

        // Заканчиваем цикл передачи данных
        I2C_GenerateSTOP( I2C1, ENABLE );
        
        return ht_last_error;
    }
    // -------------------------------------------------------------------------
    // Чтение из порта
    i2c_setNACK();
    uint8_t ack_temp = i2c_read_byte();

    ht_last_error = i2c_getLastError();
    // -------------------------------------------------------------------------
    // Заканчиваем цикл передачи данных
    I2C_GenerateSTOP( I2C1, ENABLE );
    // -------------------------------------------------------------------------
    return ack_temp;
    // -------------------------------------------------------------------------
}
// -----------------------------------------------------------------------------
// Начальная инициализация драйвера и устройства
void HT16K33_Init(uint8_t chip_number, uint8_t int_enabled) {
    // -------------------------------------------------------------------------
#ifdef HT_USE_I2C_INITIALIZATION
    // Уставка скорости шины I2C для часов реального времени
    IIC_Init(HT_I2C_SPEED, I2C_SELF_ADDRESS);
#endif
    // -------------------------------------------------------------------------
    // Запуск системного генератора в чипе
    HT16K33_WriteCMD(chip_number, HT16K33_CMD_SYSSET_ON);
    // -------------------------------------------------------------------------
    // Настройка вывода INT
    if (int_enabled == 0) {
        
        // На просто вывод для сегмента
        HT16K33_WriteCMD(chip_number, HT16K33_CMD_INT_OFF);
    } else {
        
        // На вывод прерывания с активным уровнем "1"
        HT16K33_WriteCMD(chip_number, HT16K33_CMD_INT_ON_POS);
    }
    // -------------------------------------------------------------------------
    // Димминг - яркость на среднюю
    HT16K33_WriteCMD(chip_number, HT16K33_CMD_DISP_BRIGHT | 0x07);
    // -------------------------------------------------------------------------
    // Включение дисплея, без мерцания
    HT16K33_WriteCMD(chip_number, HT16K33_CMD_DISP_NORMAL);
    // -------------------------------------------------------------------------
}
// -----------------------------------------------------------------------------
// Установка яркости дисплея [0..15]
void HT16K33_Intensity(uint8_t chip_number, uint8_t brightness) {
    
    HT16K33_WriteCMD(chip_number, (HT16K33_CMD_DISP_BRIGHT | (brightness & 0x0F)));
}
// -----------------------------------------------------------------------------
// Отсылка символа в указанное знакоместо
void HT16K33_Send(uint8_t chip_number, uint8_t place, uint8_t value) {
    
    uint8_t _value = value;
    uint8_t _dp = 0;
    
    if (is_set_idx(value, 7)) {
        
        _dp = 1;
        cbi(_value, 7);
    }
    
    uint8_t data = _symbol[_value];
   
    if (_dp == 1) { sbi(data, HT_DP_BIT); }
    
    // Перекодирование номеров знакомест в зависимости от реального подключения
    HT16K33_Write(chip_number, HT_DIGITS_ADDRESS[place], data);
    //HT16K33_Write(chip_number, place, data);
}
// -----------------------------------------------------------------------------