/********************************** (C) COPYRIGHT ******************************
 * File Name          : matrix_menu.h
 * Author             : vantr
 * Version            : V1.3.1
 * Date               : 2026/07/10
 * Description        : Библиотека для создания экранных меню
 * Module             : Графическая библиотека MATRIX™
 *******************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_MATRIXMNU110__
// -----------------------------------------------------------------------------
#define __SSS_MATRIXMNU110__
// -----------------------------------------------------------------------------
#include "app_config.h"
#include "matrix_engine.h"

// -----------------------------------------------------------------------------
typedef enum {

    Unknown = 0,  // Неизвестно
    Newed,        // Только что созданное меню, еще не отображалось
    Running       // Меню в действии
} TFT_MenuState;

// -----------------------------------------------------------------------------
// Описание элемента меню
typedef struct {
    Point Location;     // Координаты меню (заполняет графический движок)
    uint8_t *Caption;   // Надпись
    uint8_t Selected;   // Флаг выделения
    uint16_t ActionID;  // Уникальный идентификатор действия
    uint16_t ColorText;
} TFT_MenuItem;

// -----------------------------------------------------------------------------
// Описание главного меню
typedef struct
{
    uint8_t *MenuName;       // Имя меню
    uint16_t MenuID;         // Уникальный идентификатор меню
    uint8_t MenuItemHeight;  // Высота единичного элемента меню
    Rect MenuRect;           // Геометрия меню
    // TFT_MenuItem *Items;              // Массив элементов меню
    uint8_t TopItemIndex;        // Индекс первого элемента
    uint8_t Count;               // Количество элементов меню
    TFT_MenuState State;             // Дополнительное важное поле
    uint8_t DefaultActionIndex;  // Индекс элемента по умолчанию
    uint8_t MenuHeapWidth;       // Ширина боковой области для заголовка
    uint16_t ColorBorder;
    uint16_t ColorText;
    uint16_t ColorBackground;
    uint16_t ColorSelectedText;
    uint16_t ColorSelectedBackground;
    uint16_t ColorMenuHeap;
    uint16_t ColorMenuHeapText;
    uint8_t TextScale;          // Размер шрифта текста [0..3]
    uint8_t TextMenuNameScale;  // Размер шрифта заголовка меню
    uint8_t TextSpace;          // Ширина пробела между символами текста
    uint8_t TextMenuSpace;      // Ширина пробела между символами заголовка
    uint8_t ViewItemNumber;     // Флаг показа номера пункта меню
    uint8_t ItemNumberWidth;    // Ширина поля для номера пункта меню
    uint8_t Level;              // Уровень вложенности текущего меню
    uint16_t Tag;               // Дополнительное поле
} TFT_Menu;

// -----------------------------------------------------------------------------
// Ширина заголовка меню
#define MENU_NAME_WIDTH 30
// -----------------------------------------------------------------------------
// Максимальное количество элементов меню
#ifndef MENU_MAX_ITEMS
#define MENU_MAX_ITEMS 32
#endif
// -----------------------------------------------------------------------------
// Максимальный уровень погружения - вложенности меню!
#ifndef MAX_MENU_LEVELS
#define MAX_MENU_LEVELS 8
#endif
// -----------------------------------------------------------------------------
// Признак отсутствия в меню выделенного элемента
#define MENU_NO_SELECTED 0xFF
// -----------------------------------------------------------------------------
// Создание и регистрация нового корневого меню: 1 - успешное, 0 - неудачное
uint8_t TFT_matrix_menu_create_new_root_menu (uint8_t select_zero);
// -----------------------------------------------------------------------------
// Создание и регистрация нового меню: 1 - успешное, 0 - неудачное
uint8_t TFT_matrix_menu_create_new_menu();
// -----------------------------------------------------------------------------
// Создание элементов меню завершено
void TFT_matrix_menu_create_menu_complete();
// -----------------------------------------------------------------------------
// Закрытие без уничтожения текущего меню при возврате на предыдущий уровень
void TFT_matrix_menu_close_menu();
// -----------------------------------------------------------------------------
// Установка значений по умолчанию
void TFT_matrix_menu_default_config (Rect client_rect, uint8_t item_height);
// -----------------------------------------------------------------------------
// Ссылка на главное меню
TFT_Menu *TFT_matrix_menu_mainmenu (void);
// -----------------------------------------------------------------------------
// Получение количества элементов в меню
uint8_t TFT_matrix_menu_get_count (void);
// -----------------------------------------------------------------------------
// Быстрое создание элемента меню из параметров
uint8_t TFT_matrix_menu_create_menuitem (uint8_t *caption, uint16_t ActionID);
// -----------------------------------------------------------------------------
// Быстрое создание элемента меню из параметров
uint8_t TFT_matrix_menu_create_menuitem2 (uint8_t *caption, uint16_t ActionID, uint16_t color);
// -----------------------------------------------------------------------------
// Получение ссылки на элемент меню
TFT_MenuItem *TFT_matrix_menu_get (uint8_t index);
// -----------------------------------------------------------------------------
// Установка области отрисовки меню
void TFT_matrix_menu_set_rect (Rect client_rect);
// -----------------------------------------------------------------------------
// Установка высоты единичного элемента меню
void TFT_matrix_menu_set_menuitem_height (uint8_t item_height);
// -----------------------------------------------------------------------------
// Установка первого отображаемого элемента меню
void TFT_matrix_menu_set_top_itemindex (uint8_t item_index);
// -----------------------------------------------------------------------------
// Установка выделенного элемента меню
void TFT_matrix_menu_set_selected (uint8_t item_index);
// -----------------------------------------------------------------------------
// Получение индекса выделенного элемента меню
int16_t TFT_matrix_menu_get_selected (void);
// -----------------------------------------------------------------------------
// Получение индекса выделенного для указанного уровня
int16_t TFT_matrix_menu_get_seldata (uint8_t Level);
// -----------------------------------------------------------------------------
// Получение выделенного элемента меню
TFT_MenuItem *TFT_matrix_menu_get_selected_item (void);
// -----------------------------------------------------------------------------
// Установка имени меню
void TFT_matrix_menu_set_name (uint8_t *caption);
// -----------------------------------------------------------------------------
// Установка отступа снизу для имени меню
void TFT_matrix_menuname_set_margin (uint8_t value);
// -----------------------------------------------------------------------------
// Установка цвета текста/выделенного текста
void TFT_matrix_menu_set_text_color (uint16_t color, uint8_t selected);
// -----------------------------------------------------------------------------
// Установка цвета неактивного/выделенного заднего плана
void TFT_matrix_menu_set_back_color (uint16_t color, uint8_t selected);
// -----------------------------------------------------------------------------
// Принудительное обновление меню
void TFT_matrix_menu_refresh_now();
// -----------------------------------------------------------------------------
// Рисование главного меню
void TFT_matrix_menu_draw();
// -----------------------------------------------------------------------------
// Полная очистка предыдущего меню
void TFT_matrix_menu_clear();
// -----------------------------------------------------------------------------
// Показать модальное окно поверх меню
void TFT_matrix_menu_show_modal_windows (uint8_t *text, uint16_t fore_color, uint16_t back_color);
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------
