/********************************** (C) COPYRIGHT ******************************
 * File Name          : uart_lib.h
 * Author             : vantr
 * Version            : V1.5.1
 * Date               : 2026/03/18
 * Description        : Библиотека для работы с UART CH32X033
 *******************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе.
 *******************************************************************************/
// ----------------------------------------------------------------------------
#ifndef UART_UNIT_H
#define UART_UNIT_H
// ----------------------------------------------------------------------------
#include "ch32v00x.h"
#include <stdio.h>
// ----------------------------------------------------------------------------
// Блок идентификатов состояния приемника
#define UART_COM_OK 0          // OK! Продолжение приема команды
#define UART_COM_BUFFERFULL 1  // Буфер полон!
#define UART_COM_COMPLETED 2   // Команда принята полностью!
#define UART_COM_FAILED 3      // Команда принята с ошибкой
#define UART_COM_EMPTY 4       // Принятая команда пустая
#define UART_COM_READY 5       // Готов принять новую команду
#define UART_COM_STOPPED 6     // Прием был остановлен программой
// -----------------------------------------------------------------------------
#define UART_ENDOFLINE 0x00  // Символ окончания строки
// ----------------------------------------------------------------------------
//  Инициализация: UART
void UART_UNIT_Init(uint32_t baudrate);
// ----------------------------------------------------------------------------
// Доступ к коду последней ошибки
uint8_t UART_getLastState();
// ----------------------------------------------------------------------------
// Отправка байта и строки
void UART_SendChar (const uint8_t data);
void UART_SendString(const uint8_t *str);

uint16_t UART_TxString2 (const uint8_t *ptr_string, uint8_t length);
void UART_print_ok();
void UART_print_crlf();
// ----------------------------------------------------------------------------
// Низкоуровневые функции обслуживания
void UART_Reset (void);
void UART_Stop (void);
void UART_Start (void);
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------
