/********************************** (C) COPYRIGHT *******************************
 * File Name          : EC11Lib.h
 * Author             : vantr
 * Version            : V1.0.0
 * Date               : 2025/12/20
 * Description        : Библиотека энкодера EC11 (модуль MEGAPACK)
 *********************************************************************************
 * Copyright (c) 2025 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе. Допускается к использованию.
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_EC11LIB_H__
#define __SSS_EC11LIB_H__
// -----------------------------------------------------------------------------
#include "app_config.h"
// -----------------------------------------------------------------------------
// Флаги направления оборотов энкодера
#define ENC_EC11_TICK_CWISE 1
#define ENC_EC11_TICK_NONE 0
#define ENC_EC11_TICK_CCWISE 2
// -----------------------------------------------------------------------------
// Инициализация портов и режимов для работы энкодера
void EC11_Init(void);
// -----------------------------------------------------------------------------
// Получение состояния вращения энкодера, обращение сбрасывает состояние!
uint8_t EC11_GetEncoderRotationState(void);
// -----------------------------------------------------------------------------
// Получение значения счетчика энкодера
uint8_t EC11_GetEncoderValue(void);
// -----------------------------------------------------------------------------
// Установка счетчика энкодера
void EC11_SetEncoderValue(uint8_t new_value);
// -----------------------------------------------------------------------------
// Получение состояния кнопки энкодера
uint8_t EC11_GetEncoderButtonState(void);
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------