/********************************** (C) COPYRIGHT *******************************
 * File Name          : sss_soundLib1.h
 * Author             : vantr
 * Version            : V1.3.0
 * Date               : 2026/07/06
 * Description        : Библиотека синтезатора звука для CH32V003
 *********************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
// -----------------------------------------------------------------------------
/* ВНИМАНИЕ! Библиотека рассчитана на работу с тактовой частотой 48MHz.
 * Библиотека предназначена для работы с протоколом X для флеш памяти.
 * Используются два таймера - TIM2
 * Сэмплы: 8000, моно, Unsigned и без заголовка Headerless
 */
// -----------------------------------------------------------------------------
#ifndef __SSS_SNDLIB1__
// -----------------------------------------------------------------------------
#define __SSS_SNDLIB1__
// -----------------------------------------------------------------------------
// Инициализация звука
void Play_SoundInit();
// -----------------------------------------------------------------------------
// Установка громкости (в процентах) [0..100]
void Play_SetVolume (uint8_t value_percent);
// -----------------------------------------------------------------------------
// Проиграть файл с флешки по его идентификатору
void Play_SoundFromFlash (uint16_t file_id);
// -----------------------------------------------------------------------------
// Проиграть указанный буфер
void Play_SoundFromBuffer (const uint8_t *buffer, uint16_t length);
// -----------------------------------------------------------------------------
// Проигрывать файл с указанным ID из непрерывной области
void Play_SoundContFromFlash (uint16_t file_id);
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------