/********************************** (C) COPYRIGHT ******************************
 * File Name          : PCF8574x.h (I2CHW)
 * Author             : vantr
 * Version            : V2.0.1
 * Date               : 2026/01/20
 * Description        : Библиотека драйвер для экспандера IO - PCF8574(A/AT)
 *******************************************************************************
 * Copyright (c) 2025 Vantr Universal Co., Ltd
 * Библиотека проверена в железе. Допускается к использованию.
 *******************************************************************************/
#ifndef SSS_PCF8574H
#define	SSS_PCF8574H
// -----------------------------------------------------------------------------
// Адреса I2C для разных серий чипа: внимание! Адрес библиотека НЕ сдвигает влево на 1 бит!
// PCF8574 		I2C_HW_ADDR		0100ABCR0	// 0x40 - 0x4E
// PCF8574AT	I2C_HW_ADDR		0111ABCR0	// 0x70 - 0x7E
// A - A2
// B - A1
// C - A0
// R - R/W
// PCF8574(T)
// -----------------------------------------------------------------------------
#include "app_config.h"
// -----------------------------------------------------------------------------
#ifdef USE_CHINESE_I2C_MODULE
#define HA_PCF8574 0x40  // Китайский модуль! 0x20 (0x27)
#endif
// -----------------------------------------------------------------------------
#ifdef USE_MY_I2C_MODULE
// PCF8574A
#define HA_PCF8574 0x70  // Мой модуль 0x38
#endif
// -----------------------------------------------------------------------------
#ifdef USE_MY_NEW_3V_MODULE
// PCF8574A
#define HA_PCF8574 0x70  // Мой новый модуль 0x38
#endif
// -----------------------------------------------------------------------------
#include "SSS_Common_Lib_V1/sss_classes.h"
// -----------------------------------------------------------------------------
uint32_t PCF_GetLastError(void);
uint32_t PCF_Write(uint8_t hrdw_addr, uint8_t chip_number, uint8_t value);
uint8_t PCF_Read(uint8_t hrdw_addr, uint8_t chip_number, uint8_t default_result);
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------