/********************************** (C) COPYRIGHT ******************************
 * File Name          : PCF8574x.c (I2CHW)
 * Author             : vantr
 * Description        : Библиотека драйвер для экспандера IO - PCF8574(A/AT)
 *******************************************************************************
 * Copyright (c) 2025 Vantr Universal Co., Ltd
 *******************************************************************************/
// -----------------------------------------------------------------------------
#include "PCF8574x.h"
#include "SSS_I2CHW_MLib_V4.4/i2c.h"
// -----------------------------------------------------------------------------
uint32_t rt_last_error = 0;
// -----------------------------------------------------------------------------
// Получить код последней ошибки
uint32_t PCF_GetLastError() {

    return rt_last_error;
}
// -----------------------------------------------------------------------------
// Создание адреса из физического адреса устройства и номера чипа (A0-A2)
uint8_t PCF_GetAddress(uint8_t hrdw_addr, uint8_t chip_number) {
    
    uint8_t ack_temp = (uint8_t)((chip_number & 0x07) << 1);
    
    return (hrdw_addr | ack_temp);
}
// -----------------------------------------------------------------------------
// Ввод произвольного адреса
// chip_number  - номер чипа на шине (A0-A2)
// mode         - режим (0 - запись, 1 - чтение)
// Выход: 0 - успешно, 1 - сбой
uint8_t PCF_SetHeader(uint8_t hrdw_addr, uint8_t chip_number, uint8_t mode) {
    // -------------------------------------------------------------------------
    uint8_t slave_addr = PCF_GetAddress(hrdw_addr, chip_number);
    // -------------------------------------------------------------------------
    switch (mode) {
        
        case 1:            
            sbi(slave_addr, 0);
            break;
            
        default:
            cbi(slave_addr, 0);
            break;
    }
    // -------------------------------------------------------------------------
    /* // Ожидание освобождения шины
    rt_last_error = i2c_wait_not_busy();
    if (I2C_ERROR_SUCCESS != rt_last_error) { return rt_last_error; }
    // -------------------------------------------------------------------------
    // Начинаем передачу по шине I2C
    I2C_GenerateSTART (I2C1, ENABLE);
    // -------------------------------------------------------------------------
    // Ожидание переключения в режим ведущего шины
    rt_last_error = i2c_wait_master_mode();
    if (I2C_ERROR_SUCCESS != rt_last_error) { return rt_last_error; }
    // -------------------------------------------------------------------------
    // Отправка 1 байта адреса переферийного устройства
    rt_last_error = i2c_send_byte (slave_addr);
    if (I2C_ERROR_SUCCESS != rt_last_error) { return rt_last_error; } */
    // -------------------------------------------------------------------------
    rt_last_error = i2c_begin_transaction (hrdw_addr, mode);
    // -------------------------------------------------------------------------
    return rt_last_error;
    // -------------------------------------------------------------------------
}
// -----------------------------------------------------------------------------
// Запись указанного значения в порт
// chip_number  - номер чипа на шине (A0-A2)
// Выход: 0 - успешно, 1 - сбой
uint32_t PCF_Write(uint8_t hrdw_addr, uint8_t chip_number, uint8_t value) {
    // -------------------------------------------------------------------------
    if (PCF_SetHeader(hrdw_addr, chip_number, 0) != I2C_ERROR_SUCCESS)
    // -------------------------------------------------------------------------
    {
        I2C_GenerateSTOP (I2C1, ENABLE);
        return rt_last_error;
    }
    // -------------------------------------------------------------------------
    rt_last_error = i2c_send_byte (value);
    if (I2C_ERROR_SUCCESS != rt_last_error) {

        I2C_GenerateSTOP (I2C1, ENABLE);
        return rt_last_error;
    }
    // -------------------------------------------------------------------------
    I2C_GenerateSTOP (I2C1, ENABLE);
    // -------------------------------------------------------------------------
    return rt_last_error;
    // -------------------------------------------------------------------------
}
// -----------------------------------------------------------------------------
// Чтение из порта
// chip_number    - номер чипа на шине (A0-A2)
// default_result - результат по умолчанию при сбое чтения
// Выход: данные если успешно, или default_result при сбое
uint8_t PCF_Read(uint8_t hrdw_addr, uint8_t chip_number, uint8_t default_result) {
    // -------------------------------------------------------------------------
    if (PCF_SetHeader(hrdw_addr, chip_number, 1) != I2C_ERROR_SUCCESS)
    // -------------------------------------------------------------------------
    {
        I2C_GenerateSTOP (I2C1, ENABLE);
        return rt_last_error;
    }
    // -------------------------------------------------------------------------
    // Установить флаг NoACK
    i2c_setNACK();
    // -------------------------------------------------------------------------
    // Чтение из массива памяти
    uint8_t result = i2c_read_byte();
    // -------------------------------------------------------------------------
    I2C_GenerateSTOP (I2C1, ENABLE);
    return result;
    // -------------------------------------------------------------------------
}
// -----------------------------------------------------------------------------
