// -----------------------------------------------------------------------------
/*  Библиотека декодирования принимаемого IR сигнала по протоколу NEC
*   MEGAPACK редакция
*   -----------------------------------------------------------------
*   Библиотека использует одно прерывание и один пин GPIO, а также TIM1!
*   © 2026 Vantr Universal Co. Ltd
*
*   v 1.2 (29.07.2026)
*/
// -----------------------------------------------------------------------------
#ifndef __SSS_IRNEC1_H__
#define __SSS_IRNEC1_H__
// -----------------------------------------------------------------------------
#include "app_config.h"
// -----------------------------------------------------------------------------
// Допустимые статусы приемника
typedef enum {
    // Данные не представлены
    IRDR_NO,
    // Данные готовы для использования
    IRDR_READY,
    // Данные готовы снова, повтор
    IRDR_REPEAT
} IR_DataReady_Type;
// -----------------------------------------------------------------------------
// Инициализация линий и прерываний для работы протокола IR NEC
void IR_Init(void);
// -----------------------------------------------------------------------------
// Получение данных из буфера приема [0..3]
uint8_t IR_GetData(uint8_t index);
// -----------------------------------------------------------------------------
// Получение предыдущих данных из буфера приема [0..3]
uint8_t IR_GetLastData(uint8_t index);
// -----------------------------------------------------------------------------
// Получение текущего статуса
IR_DataReady_Type IR_GetStatus();
// -----------------------------------------------------------------------------
// Сброс статуса
void IR_ResetStatus();
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------