/********************************** (C) COPYRIGHT *******************************
 * File Name          : epr_lib1.h
 * Author             : vantr
 * Version            : V1.0.1
 * Date               : 2026/03/27
 * Description        : Драйвер для EEPROM 24Cxx (аппаратный I2C) CH32X033
 *********************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 * ------------------------------------------------------------------------------
 * ВНИМАНИЕ! Применение в программе отладочных printf может привести
 * к неработоспособности данного драйвера!
 * Не забывайте правильно настраивать источник тактирования MCU!
 *******************************************************************************/
// ----------------------------------------------------------------------------
#ifndef __XC_EPRNXX_H__
#define __XC_EPRNXX_H__
// ----------------------------------------------------------------------------
#include "SSS_Common_Lib_V1/sss_classes.h"
// ----------------------------------------------------------------------------
#define I2C_DISABLE_USART1
// Допустимые к работе чипы
// Оставьте только один!
//#define DEV_2402
//#define DEV_2404
//#define DEV_2408
#define DEV_2416
//#define DEV_2432
//#define DEV_2464
// ----------------------------------------------------------------------------
#define EPR_CHIP_I2C_ADDR   0xA0
// ----------------------------------------------------------------------------
// Если нужна инициализация I2C, раскомментируйте флаг ниже
// Если шина уже инициализирована, закомментируйте флаг
//#define EPR_INIT_I2C
// ----------------------------------------------------------------------------
// Использовать только страничные режимы доступа к памяти
#define USE_PAGE_MODES_ONLY
// Использовать режимы записи
//#define USE_WRITE_MODES
// ----------------------------------------------------------------------------
void EPR_Init();
uint32_t EPR_getLastError();
// ----------------------------------------------------------------------------
// Получение адресов обращения к памяти
Params EPR_getAddress (uint8_t epr_device_phy_addr, uint16_t address);
// ----------------------------------------------------------------------------
#ifdef USE_WRITE_MODES
#ifndef USE_PAGE_MODES_ONLY
void EPR_writeByte(uint8_t epr_device_phy_addr, uint16_t WriteAddr, uint8_t Data);
#endif
void EPR_writePage(uint8_t epr_device_phy_addr, uint16_t WriteAddr, uint8_t *buffer, uint16_t length);
#endif
// ----------------------------------------------------------------------------
#ifndef USE_PAGE_MODES_ONLY
uint8_t EPR_readByte(uint8_t epr_device_phy_addr, uint16_t ReadAddr);
#endif
uint16_t EPR_readPage(uint8_t epr_device_phy_addr, uint16_t ReadAddr, uint8_t *buffer, uint16_t length);
// ----------------------------------------------------------------------------
#endif
// ----------------------------------------------------------------------------