/********************************** (C) COPYRIGHT ******************************
 * File Name          : matrix_cyrillic.h
 * Author             : vantr
 * Version            : V1.0.0
 * Date               : 2026/02/08
 * Description        : Библиотека вывода кириллицы из UTF8
 *******************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_H_GRCYR1_H
#define	__SSS_H_GRCYR1_H
// -----------------------------------------------------------------------------
#include <stdint.h>
// -----------------------------------------------------------------------------
void matrix_cyr_Set_NOCyrillic();
uint8_t matrix_cyr_Get_NOCyrillic();
void matrix_cyr_RESet_NOCyrillic();

uint8_t matrix_cyr_BASE_UTF2CYR (uint8_t value1, uint8_t value2);
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------
