/********************************** (C) COPYRIGHT *******************************
 * File Name          : sss_fastGpio_lib1.h
 * Author             : vantr
 * Version            : V1.0.0
 * Date               : 2026/08/04
 * Target             : CH32V003
 * Description        : Быстрый доступ к пинам
 *********************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_CLFGPIO1__
// -----------------------------------------------------------------------------
#define __SSS_CLFGPIO1__
// -----------------------------------------------------------------------------
#include "SSS_Common_Lib_V1/sss_classes.h"
// -----------------------------------------------------------------------------
// Проверка на валидность данных пина
uint8_t fgpio_pinDefined (const PinDefine_t *pin);
// -----------------------------------------------------------------------------
// Открыть пин для работы с ним
void fgpio_openPin (const PinDefine_t *pin, GPIOMode_TypeDef mode);
// -----------------------------------------------------------------------------
// Установить на пине указанное значение (0/1)
void fgpio_setPin (const PinDefine_t *pin, uint8_t level);
// -----------------------------------------------------------------------------
// Прочитать из пина значение (0/1) - или 0xFF, если невозможно
uint8_t fgpio_getPin (const PinDefine_t *pin);
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------