/********************************** (C) COPYRIGHT ******************************
 * File Name          : matrix_engine.h
 * Author             : vantr
 * Version            : V1.1.0
 * Date               : 2026/05/04
 * Description        : Библиотека графики для LCD дисплея на ST920
 * Module             : Графическая библиотека MATRIX™
 * Target             : CH32X033
 *******************************************************************************
 * Поддержка GFX и потоковых/бинарных шрифтов
 *******************************************************************************
 * Copyright (c) 2025 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_MATRIX100__
// -----------------------------------------------------------------------------
#define __SSS_MATRIX100__
// -----------------------------------------------------------------------------
#include "app_config.h"
#include "SSS_Common_Lib_V1/sss_classes.h"
#include "SSS_Common_Lib_V1/sss_graphics_common_types.h"
// -----------------------------------------------------------------------------
#define SSD1306_USE_MY_FONTS
// -----------------------------------------------------------------------------
// Рассчет необходимого размера буффера для указанного разрешения дисплея
#define ST920_matrix_HARDWARE_BUFFER_SIZE ((ST920_DISPLAY_HEIGHT * ST920_DISPLAY_WIDTH) / 8)
// -----------------------------------------------------------------------------
// Сдвиг кода символа при печати
#define MATRIX_SHIFT_SYMCODE        0x20
// -----------------------------------------------------------------------------
typedef enum {
    DL_Normal = 0,
    DL_Rotate = 1
} DisplayLayout;
// -----------------------------------------------------------------------------
// Контекст отрисовки стандартного текста
typedef struct {
    uint8_t scale;
    WriteString_DirectionType direction;
    WriteString_WrapMode wrap_mode;
    WriteString_Align align;
    DisplayLayout image_layout;
    uint8_t space;
    uint8_t x_brush;
    uint8_t x_bg_transparent;
    int16_t x_caret;
    int16_t y_caret;
    uint8_t inverse;
} TextContext5;
// -----------------------------------------------------------------------------
// Для управления контекстом
typedef enum {
    TX_Scale5,
    TX_Direction5,
    TX_Space5,
    TX_Wrap5,
    TX_Align5,
    TX_X_Caret5,
    TX_Y_Caret5,
    TX_Inverse5,
    TX_Brush5,
    DL_Layout5
} TextContextTypes5;
// -----------------------------------------------------------------------------
// Обновление экрана V3 упрощенная адресация
// Используется при окончании отрисовки фрейма
void ST920_matrix_refresh();
// -----------------------------------------------------------------------------
// Установка свойств контекста вывода строк стандартным шрифтом
void ST920_matrix_set_textContext_prop(TextContextTypes5 prop_name, int16_t value);
// -----------------------------------------------------------------------------
// Установить цвет переднего плана
void ST920_matrix_setBrush (uint8_t color);
// -----------------------------------------------------------------------------
// Установка флага прозрачности заднего плана
void ST920_matrix_set_bg_transparent(uint8_t value);
// -----------------------------------------------------------------------------
// Посмотреть цвет переднего плана
uint8_t ST920_matrix_getBrush();
// -----------------------------------------------------------------------------
// Посмотреть цвет заднего плана (инверсный цвету переднего плана)
uint8_t ST920_matrix_getBackColor();
// -----------------------------------------------------------------------------
// Печать строки на индикатор, функция обновляет экран
void ST920_matrix_writeString(uint8_t *str);
// -----------------------------------------------------------------------------
// Горизонтальная масштабируемая печать пропорциональным стандартным шрифтом
void ST920_matrix_writeCharScaled (uint8_t sym);
// -----------------------------------------------------------------------------
// Вертикальная масштабируемая печать пропорциональным стандартным шрифтом
void ST920_matrix_writeVCharUpScaled (uint8_t sym);
// -----------------------------------------------------------------------------
// Метод печати строки стандартным шрифтом в центр указанной области с центровкой и обрезкой (ellipsis) по границам области
void ST920_matrix_drawStringInscribed_Smart (uint8_t *str, Rect area_owner);
// -----------------------------------------------------------------------------
// Вывод горизонтальной строки из указанного количества пикселей в текущую позицию каретки
void ST920_matrix_writeHByte (uint8_t value, uint8_t length);
// -----------------------------------------------------------------------------
// Вывод вертикальной строки вниз из указанного количества пикселей в текущую позицию каретки
void ST920_matrix_writeVByteDown(uint8_t value, uint8_t length);
// -----------------------------------------------------------------------------
// Вывод вертикальной строки вверх из указанного количества пикселей в текущую позицию каретки
void ST920_matrix_writeVByteUp(uint8_t value, uint8_t length);
// -----------------------------------------------------------------------------
// Очистка физического и буфера экрана с обновлением
void ST920_matrix_clearScreen();
// -----------------------------------------------------------------------------
// Очистка буфера и инициализация графики без изменения физического экрана
// Используется для начала рисования фрейма
void ST920_matrix_frame_init();
// -----------------------------------------------------------------------------
// Установка области отрисовки дисплея
void ST920_matrix_set_clientrect(Rect value);
// -----------------------------------------------------------------------------
// Получение области отрисовки экрана
Rect ST920_matrix_get_clientrect();
// -----------------------------------------------------------------------------
// Проверка, попадает ли указанная точка в указанную область
uint8_t ST920_matrix_point_in_rect(Point data, Rect rect);
// -----------------------------------------------------------------------------
// Проверка, попадает ли указанная точка в отрисовываемую область экрана
uint8_t ST920_matrix_point_in_cliprect(uint8_t X, uint8_t Y);
// -----------------------------------------------------------------------------
// Рисование или гашение пикселя в указанной позиции буфера экрана [32x8], не обновляет экран
void ST920_matrix_setPixel(uint8_t X, uint8_t Y, uint8_t Value);
// -----------------------------------------------------------------------------
// Возврат каретки в начальную, нулевую позицию
void ST920_matrix_returnCaret();
// -----------------------------------------------------------------------------
// Установка каретки в любое указанное положение [-127...127]
void ST920_matrix_setCaret(int16_t value);
// -----------------------------------------------------------------------------
// Сдвиг каретки на указанное количество пикселей [-127...127]
void ST920_matrix_addCaret(int16_t value);
// -----------------------------------------------------------------------------
// Установка каретки в указанные координаты матрицы
void ST920_matrix_setCoord(int16_t X, int16_t Y);
// -----------------------------------------------------------------------------
// Установка каретки в указанные координаты матрицы
void ST920_matrix_setCoord2(Point data);
// -----------------------------------------------------------------------------
// Установка отступа по вертикали
void ST920_matrix_setMargin(int16_t value);
// -----------------------------------------------------------------------------
// Инверсия содержимого экрана
void ST920_matrix_inverseScreen();
// -----------------------------------------------------------------------------
// Скроллинг экрана на одну позицию влево
void ST920_matrix_scrollLeft();
// -----------------------------------------------------------------------------
// Рассчет длины указанной строки в пикселях
Size ST920_matrix_measureString (uint8_t *str);
// -----------------------------------------------------------------------------
// Вывод пользовательского символа указанного размера [64x8]
void ST920_matrix_writeCustomChar(uint8_t *image, uint8_t width, uint8_t height);
// -----------------------------------------------------------------------------
// Вывод пользовательского символа указанного размера до [64x16]
void ST920_matrix_writeLargeCustomChar(uint16_t *image, uint8_t width, uint8_t height);
// -----------------------------------------------------------------------------
// Вывод пользовательского изображения до [64x32]
void ST920_matrix_writeBitmap(uint32_t *image, uint8_t height);
// -----------------------------------------------------------------------------
// Вывод пользовательского изображения до [64x32]
void ST920_matrix_writeBitmapEx (const uint8_t *bitmap, uint8_t width, uint8_t height);
// -----------------------------------------------------------------------------
// Печать одного символа бинарного шрифта
void ST920_matrix_writeCharBin (const uint8_t ch, const BINFont *font, float line_spacing);
// -----------------------------------------------------------------------------
// Печать строки символами двоичного шрифта
void ST920_matrix_writeStringBin(const uint8_t *str, const BINFont *font, float line_spacing);
// -----------------------------------------------------------------------------
// Измерение длины строки BIN
Size ST920_matrix_measureStringBin (const uint8_t *str, const BINFont *font);
// -----------------------------------------------------------------------------
// Печать символов из шрифтов GFX
void ST920_matrix_drawString_GFX2X (const uint8_t *str, const GFXfont *font, float line_spacing);
// -----------------------------------------------------------------------------
// Заливка указанного прямоугольника, функция не обновляет экран
void ST920_matrix_fill_rect (Rect area, uint8_t value);
// -----------------------------------------------------------------------------
// Заливка указанного прямоугольника, функция не обновляет экран
void ST920_matrix_fill_rect2(uint8_t x, uint8_t y, uint8_t w, uint8_t h, uint8_t value);
// -----------------------------------------------------------------------------
// Создание точки из координат
Point ST920_matrix_create_point(uint8_t X, uint8_t Y);
// -----------------------------------------------------------------------------
// Создание структуры размера из данных
Size ST920_matrix_create_size(uint8_t width, uint8_t height);
// -----------------------------------------------------------------------------
// Создание прямоугольной области
Rect ST920_matrix_create_rect(Point coords, Size client_size);
// -----------------------------------------------------------------------------
// Создание прямоугольной области
Rect ST920_matrix_create_rect2(uint8_t X, uint8_t Y, uint8_t Width, uint8_t Height);
// -----------------------------------------------------------------------------
// Рисование линии по алгоритму Брезенхейма
void ST920_matrix_line(int x0, int y0, int x1, int y1);
// -----------------------------------------------------------------------------
// Рисование линии по алгоритму Брезенхейма
void ST920_matrix_line2(Point A1, Point A2);
// -----------------------------------------------------------------------------
// Рисование окружности методом Брезенхейма
void ST920_matrix_circle(int x0, int y0, int radius, uint8_t fill);
// -----------------------------------------------------------------------------
// Рисование окружности методом Брезенхейма
void ST920_matrix_circle2(Point data, uint8_t fill);
// -----------------------------------------------------------------------------
// Рисование полигона из произвольного количества отрезков (больше одного)
void ST920_matrix_polygon(Point *data, uint8_t count, uint8_t closed);
// -----------------------------------------------------------------------------
// Построение заштрихованного прямоугольника
void ST920_matrix_filled_rect(Point data, Size size);
// -----------------------------------------------------------------------------
// Сдвиг указанных координат на указанный диапазон [-127..127]
Point ST920_matrix_shift_coords(Point data, int8_t X, int8_t Y);
// -----------------------------------------------------------------------------
// Рисование простой рамки указанного размера
void ST920_matrix_draw_rect(Point data, Size size);
// -----------------------------------------------------------------------------
// Рисование простой рамки указанного размера
void ST920_matrix_draw_rect2(Rect area);
// -----------------------------------------------------------------------------
// Рамка в один пиксель по краям дисплея
void ST920_matrix_client_rect();
// -----------------------------------------------------------------------------
// Получение координат верхнего правого угла прямоугольной области
Point ST920_matrix_get_rect_topright(Rect rect);
// -----------------------------------------------------------------------------
// Получение координат верхнего правого угла прямоугольной области
Point ST920_matrix_get_rect_bottomright(Rect rect);
// -----------------------------------------------------------------------------
// Получение координат верхнего правого угла прямоугольной области
Point ST920_matrix_get_rect_bottomleft(Rect rect);
// -----------------------------------------------------------------------------
// Пропорционально уменьшить прямоугольную область
Rect ST920_matrix_reduce_rect(Rect rect, uint8_t value);
// -----------------------------------------------------------------------------
// Пропорционально уменьшить прямоугольную область на один пиксель
Rect ST920_matrix_reduce_rect2(Rect rect);
// -----------------------------------------------------------------------------
// Пропорционально увеличить прямоугольную область
Rect ST920_matrix_increase_rect(Rect rect, uint8_t value);
// -----------------------------------------------------------------------------
// Вычисление области пересечения двух областей
Rect ST920_matrix_rect_intersect (Rect r1, Rect r2);
// -----------------------------------------------------------------------------
// Проверка, является ли указанная область пустой
uint8_t ST920_matrix_rect_isEmpty (Rect area);
// -----------------------------------------------------------------------------
// Получение координат углов указанной области
Point ST920_matrix_get_corner (Rect area, Corner subject);
// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------
