/********************************** (C) COPYRIGHT ******************************
 * File Name          : matrix_menu.h
 * Author             : vantr
 * Version            : V1.0.2
 * Date               : 2026/04/07
 * Description        : Библиотека создания меню
 * Module             : Графическая библиотека MATRIX™
 * Target             : CH32V003
 *******************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
#include "matrix_engine.h"
// -----------------------------------------------------------------------------
typedef enum {

    Unknown = 0,  // Неизвестно
    Newed,        // Только что созданное меню, еще не отображалось
    Running       // Меню в действии
} ST920_MenuState;
// -----------------------------------------------------------------------------
// Описание элемента меню
typedef struct {
    Point Location;                 // Координаты меню (заполняет графический движок)
    uint8_t *Caption;               // Надпись
    uint8_t Selected;               // Флаг выделения
    uint16_t ActionID;              // Уникальный идентификатор действия
} ST920_MenuItem;
// -----------------------------------------------------------------------------
// Описание главного меню
typedef struct {
    uint8_t *MenuName;              // Имя меню
    uint16_t MenuID;                // Уникальный идентификатор меню
    uint8_t MenuItemHeight;         // Высота единичного элемента меню
    uint8_t MenuHeapWidth;          // Ширина боковой области для заголовка
    Rect MenuRect;                  // Геометрия меню
    uint8_t TopItemIndex;           // Индекс первого элемента
    ST920_MenuState State;                // Дополнительное важное поле
    uint8_t DefaultActionIndex;     // Индекс элемента по умолчанию
    uint8_t Count;                  // Количество элементов меню
    uint8_t Scale;                  // Размеры надписей меню
    uint8_t TextMenuNameScale;      // Размер шрифта заголовка меню
    uint8_t ViewItemNumber;         // Флаг показа номера пункта меню
    uint8_t ItemNumberWidth;        // Ширина поля для номера пункта меню
} ST920_Menu;
// -----------------------------------------------------------------------------
// Признак отсутствия в меню выделенного элемента
#define MENU_NO_SELECTED        0xFF
// -----------------------------------------------------------------------------
// Установка значений по умолчанию
void ST920_matrix_menu_default_config (Rect ST920_client_rect, uint8_t item_height);
// -----------------------------------------------------------------------------
// Ссылка на главное меню
ST920_Menu *ST920_matrix_menu_mainmenu (void);
// -----------------------------------------------------------------------------
// Получение количества элементов в меню
uint8_t ST920_matrix_menu_get_count();
// -----------------------------------------------------------------------------
// Быстрое создание элемента меню из параметров
void ST920_matrix_menu_create_menuitem(uint8_t *caption, uint16_t ActionID);
// -----------------------------------------------------------------------------
// Получение ссылки на элемент меню
ST920_MenuItem *matrix_menu_get(uint8_t index);
// -----------------------------------------------------------------------------
// Установка области отрисовки меню
void ST920_matrix_menu_set_rect(Rect ST920_client_rect);
// -----------------------------------------------------------------------------
// Установка высоты единичного элемента меню
void ST920_matrix_menu_set_menuitem_height(uint8_t item_height);
// -----------------------------------------------------------------------------
// Установка первого отображаемого элемента меню
void ST920_matrix_menu_set_top_itemindex(uint8_t item_index);
// -----------------------------------------------------------------------------
// Установка выделенного элемента меню
void ST920_matrix_menu_set_selected(uint8_t item_index);
// -----------------------------------------------------------------------------
// Получение индекса выделенного элемента меню
ST920_MenuItem* ST920_matrix_menu_get_selected();
// -----------------------------------------------------------------------------
// Установка имени меню
void ST920_matrix_menu_set_name(uint8_t * caption);
// -----------------------------------------------------------------------------
// Установка отступа снизу для имени меню
void ST920_matrix_menuname_set_margin(uint8_t value);
// -----------------------------------------------------------------------------
// Рисование главного меню
void ST920_matrix_menu_draw();
// -----------------------------------------------------------------------------
// Очистка меню
void ST920_matrix_menu_clear();
// -----------------------------------------------------------------------------