/********************************** (C) COPYRIGHT *******************************
 * File Name          : sss_xproto_targets.h
 * Author             : vantr
 * Version            : V2.0.1
 * Date               : 2026/03/18
 * Description        : Библиотека X-Proto - данные проекта
 *********************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef __SSS_XPROTOTAREG1__
// -----------------------------------------------------------------------------
#define __SSS_XPROTOTAREG1__
// -----------------------------------------------------------------------------
// Цели полностью зависят от текущего проекта
// -----------------------------------------------------------------------------
// Идентификатор пакета бинарных данных
#define XP_DATA_TEST_PACKET             0x00
// -----------------------------------------------------------------------------
// Идентификатор пакета бинарных данных
#define XP_BINDATA_PACKET               0x01
// -----------------------------------------------------------------------------
// Идентификатор статусного пакета
#define XP_STATUS_PACKET                0x02
// -----------------------------------------------------------------------------
// Идентификатор пакета с командой
#define XP_CMD_PACKET                   0x03
// -----------------------------------------------------------------------------
// Идентификатор пакета запроса на чтение данных
#define XP_BINDATA_READ_PACKET          0x04
// -----------------------------------------------------------------------------
// Идентификатор пакета запроса на запись данных
#define XP_BINDATA_WRITE_PACKET         0x05
// -----------------------------------------------------------------------------
// Идентификатор пакета запроса на чтение данных
#define XP_FLASHPAGE_READ_PACKET        0x06
// -----------------------------------------------------------------------------
// Идентификатор пакета запроса на запись данных
#define XP_FLASHPAGE_WRITE_PACKET       0x07
// -----------------------------------------------------------------------------
// Идекнтификатор пакета непрерывной записи
#define XP_FLASHPAGE_CONTWRITE_PACKET   0x08
// -----------------------------------------------------------------------------
// Константы
// -----------------------------------------------------------------------------

// -----------------------------------------------------------------------------
#endif
// -----------------------------------------------------------------------------