/********************************** (C) COPYRIGHT *******************************
 * File Name          : sss_adc_libex.h
 * Author             : vantr
 * Version            : V1.1.0
 * Date               : 2026/01/19
 * Description        : Библиотека поддержки ADC для CH32X033
 *********************************************************************************
 * Copyright (c) 2026 Vantr Universal Co., Ltd.
 * Библиотека проверена в железе. Допускается к использованию.
 *******************************************************************************/
// -----------------------------------------------------------------------------
#ifndef ADC_DRIVERX033_H_
#define ADC_DRIVERX033_H_
// ----------------------------------------------------------------------------
#include "ch32x035.h"
// ----------------------------------------------------------------------------
// Номинальное значение VrefInt в милливольтах (1.2V)
#define VREF_INT_MV     1200                    // Типичное значение для X033 (1.2V)
#define ADC_MAX_RAW     4095                    // 12 бит
#define ADC_CH_VREF     ADC_Channel_Vrefint     // Vrefint на X033
// ----------------------------------------------------------------------------
void ADC_PowerSafe_Init(void);
uint16_t ADC_Get_Raw(uint8_t ch);
uint32_t ADC_Get_VDD_mv(void);
uint32_t ADC_Get_Voltage_mv(uint8_t ch);
uint32_t ADC_Get_Voltage_Direct_mv(uint8_t ch);
uint32_t ADC_Get_Average_Voltage_mv(uint8_t ch, uint8_t count);
// ----------------------------------------------------------------------------
#endif
    // ----------------------------------------------------------------------------
